[
{
 "title": "Indian Tomato Chicken",
 "ingredients": ["1 large onion, chopped",
                 "4 cloves garlic, chopped",
                 "1 slice fresh ginger root",
                 "1 tablespoon olive oil",
                 "2 teaspoons ground cumin",
                 "1 teaspoon ground turmeric", "1 teaspoon salt",
                 "1 teaspoon ground black pepper", "1/2 teaspoon ground cardamom",
                 "1 (1 inch) piece cinnamon stick",
                 "1/4 teaspoon ground cloves",
                 "2 bay leaves",
                 "1/4 teaspoon ground nutmeg",
                 "6 skinless chicken thighs",
                 "1 (14.5 ounce) can whole peeled tomatoes, crushed",
                 "Add all ingredients to list",
                 "Add all ingredients to list"],
 "procedures": ["Place onion, garlic and ginger in a food processor and process into a paste. Heat oil in a large skillet over medium heat, add onion paste and saute, stirring continuously, for about 10 minutes.\n                            ",
                "Stir in the cumin, turmeric, salt, pepper, cardamom, cinnamon, cloves, bay leaves and nutmeg. Saute, stirring, for 1 to 2 minutes. Place chicken pieces in skillet and stir them around with the spice mixture until they are well coated.\n                            ", "Saute for another 4 minutes, then pour in the tomatoes with liquid and stir. Reduce heat to low and simmer for 1 to 2 hours, or until the oil has separated from the liquid. Stir occasionally. (Note: If you simmer uncovered, the sauce will thicken; add water, or keep covered while simmering.)\n                            "],
},
{
 "title": "Tomato Cucumber Kachumbar",
 "ingredients": ["1 cup halved grape tomatoes",
                 "1 cup diced cucumber", "1/2 cup chopped green onions",
                 "1/2 cup chopped fresh cilantro",
                 "1 tablespoon fresh lemon juice",
                 "1 tablespoon chopped fresh mint",
                 "salt and ground black pepper to taste",
                 "Add all ingredients to list",
                 "Add all ingredients to list"],
 "procedures": ["Mix grape tomatoes, cucumber, green onions, cilantro, lemon juice, mint, salt, and pepper together in a large bowl.\n                            "],
},
{
 "title": "Indian Tomato Rice",
 "ingredients": ["1/3 cup vegetable oil",
                 "2 onions, diced",
                 "1 1/2 teaspoons salt",
                 "1 clove garlic, minced",
                 "1 teaspoon chile powder",
                 "1 teaspoon minced fresh ginger root",
                 "1/2 teaspoon ground turmeric",
                 "2 cups diced tomatoes", "2 1/4 cups basmati rice",
                 "3 cups water", "Add all ingredients to list",
                 "Add all ingredients to list"],
 "procedures": ["Heat oil in a saucepan over medium heat; cook and stir onions until golden, 10 to 15 minutes. Add salt, garlic, chile powder, ginger, and turmeric; stir to coat. Mix tomatoes into onion mixture; cook and stir until tomatoes begin to break down, 5 to 10 minutes.\n                            ",
                "Stir rice into onion-tomato mixture and pour in water. Bring to a boil; reduce heat to low, cover, and simmer, stirring occasionally, until rice is tender and liquid is absorbed, 15 to 20 minutes.\n                            "],
},
{
 "title": "Tomato Bhath (Tomato Rice)",
 "ingredients": ["1 tablespoon cooking oil",
                 "1 tablespoon split Bengal gram (chana dal)",
                 "1 teaspoon skinned split black lentils (urad dal)",
                 "4 dried red chile peppers", "2 teaspoons coriander seeds",
                 "1 teaspoon cumin seeds",
                 "1 tablespoon flaked coconut",
                 "2 tablespoons cooking oil",
                 "1/4 cup peanuts",
                 "1 teaspoon mustard seeds",
                 "2 large onions, minced",
                 "3 green chile peppers, halved lengthwise",
                 "2 sprigs fresh curry leaves",
                 "1/4 teaspoon asafoetida powder",
                 "3 tomatoes, minced",
                 "1/2 teaspoon ground turmeric",
                 "1/2 teaspoon white sugar",
                 "salt to taste",
                 "3 cups cold, cooked white rice",
                 "2 tablespoons chopped fresh cilantro, for garnish",
                 "Add all ingredients to list",
                 "Add all ingredients to list"],
 "procedures": ["Make the masala podi by heating 1 tablespoon oil in a skillet over medium heat; fry the chana dal, urad dal, dried chile peppers, coriander seeds, and cumin seeds in the hot oil until fragrant and beginning to brown, about 5 minutes. Grind the mixture with the coconut into a fine powder using a mortar and pestle.\n                            ",
                "Heat 2 tablespoons oil in a large skillet. Fry the peanuts and mustard seeds in the hot oil until the peanuts begin to brown, 2 to 3 minutes. Add the onions, green chile peppers, curry leaves, and asafoetida powder to the peanut mixture; cook and stir until the onions are browned, 5 to 7 minutes. Stir the tomatoes, turmeric, sugar, and salt into the mixture; continue cooking until the tomatoes are soft, about 10 minutes more. Season with the masala podi. Crumble the rice into the skillet, using the back of a spoon to separate the individual grains. Cook and stir until the rice is mixed into the dish and hot, 5 to 7 minutes. Garnish with the cilantro to serve.\n                            "],
},
{
 "title": "Jorge's Indian-Spiced Tomato Lentil Soup",
 "ingredients": ["4 cups low-sodium vegetable broth, divided",
                 "1 small yellow onion, finely chopped",
                 "1 clove garlic, finely chopped",
                 "1 teaspoon ground coriander",
                 "1/2 teaspoon ground cinnamon",
                 "1/8 teaspoon ground turmeric",
                 "1/8 teaspoon garam masala",
                 "1/8 teaspoon cayenne pepper",
                 "1 cup red lentils",
                 "1 (14.5 ounce) can no-salt-added diced tomatoes, undrained",
                 "1 tablespoon fresh lemon juice (optional)",
                 "1 tablespoon crumbled feta cheese (optional)",
                 "Add all ingredients to list",
                 "Add all ingredients to list"],
 "procedures": ["Bring 1/2 cup broth to a boil in a pot; reduce heat and simmer. Add onion and garlic and simmer until onion is translucent and tender, about 5 minutes. Stir coriander, cinnamon, turmeric, garam masala, and cayenne pepper into onion mixture; simmer for 1 minute.\n                            ",
                "Stir lentils into spiced onion mixture; cook, stirring constantly, for 30 seconds. Add remaining 3 1/2 cups broth and tomatoes; bring to a boil. Reduce heat to low, cover, and simmer until lentils are tender, 10 to 12 minutes. Stir lemon juice into soup and garnish with feta cheese.\n                            "],
}
]